{
  "header.title.1": "Brainrot",
  "header.title.2": "Generator",
  "header.subtitle": "Transform your boring photos. Upload, describe the chaos, and unleash the AI.",
  "upload.label": "1. Upload your image",
  "upload.cta": "Click to upload",
  "upload.drag": "or drag and drop",
  "upload.formats": "PNG, JPG, GIF up to 10MB",
  "prompt.label": "2. What do you want to merge with? (Optional)",
  "prompt.placeholder": "e.g., a pineapple, a tractor, a golden ring...",
  "generate.label": "3. Generate",
  "generate.button.loading": "Generating...",
  "generate.button.default": "Make it Brainrot",
  "display.label": "Brainrot",
  "display.placeholder": "Image will appear here",
  "display.download": "Download Image",
  "display.download.aria": "Download image",
  "footer.poweredBy": "Powered by Gemini",
  "inspiration.title": "Inspiration: What is Brainrot?",
  "error.uploadFirst": "Please upload an image first.",
  "error.unknown": "An unknown error occurred.",
  "error.noImageGenerated": "No image was generated by the API.",
  "error.generationFailed": "Could not generate the image. Check the console for more details.",
  "gemini.prompt.base": "IMPORTANT TASK: Transform the person in this photo into an absurd, 'brainrot' hybrid by literally merging them with {OBJECT}.\n\nSTEP 1: ISOLATE & REMOVE. Completely isolate the person from the original background. The original background must disappear entirely.\n\nSTEP 2: FUSE & MUTATE THE FACE. Create a PHOTOREALISTIC and seamless fusion. THIS IS THE MOST IMPORTANT RULE: It must be a deep, 3D integration. The facial surface must completely transform. It should look as if the face is physically sculpted from the material of the new object/animal. The texture and material must follow the contours of the face. EXAMPLE: If the object is a pineapple, the skin of the face must take on the texture and pattern of a pineapple rind. The lighting and shadows on the face must perfectly match the rest of the character and the environment, making it a single entity. The transition between the 'recognizable' face and the rest of the mutated head/body must be smooth and invisible. The rest of the body and head merge completely.\n\nSTEP 3: CREATE ENVIRONMENT. Place the new, mutated character in a completely new, thematically appropriate, and surreal environment. The environment should complement and enhance the absurd transformation.\n\nSTEP 4: GIVE IT LIFE. Ensure the character is not static. Give it a dynamic pose or facial expression that suggests it can move, react, and live in its new environment. It must feel like a real, living being, not a statue.\n\nFINAL REQUIREMENTS: The final result must be a single, cohesive, photorealistic image. The person must be able to clearly recognize themselves, despite the absurd mutation. No loose emojis.",
  "gemini.prompt.defaultObject": "a random animal or object"
}
