{
  "header.title.1": "Brainrot",
  "header.title.2": "Generator",
  "header.subtitle": "Transformeer je saaie foto's. Upload, beschrijf de chaos en laat de AI los.",
  "upload.label": "1. Upload je afbeelding",
  "upload.cta": "Klik om te uploaden",
  "upload.drag": "of sleep het bestand hierheen",
  "upload.formats": "PNG, JPG, GIF tot 10MB",
  "prompt.label": "2. Waarmee wil je versmelten? (Optioneel)",
  "prompt.placeholder": "bijv. een ananas, een tractor, een gouden ring...",
  "generate.label": "3. Genereer",
  "generate.button.loading": "Genereren...",
  "generate.button.default": "Maak het Brainrot",
  "display.label": "Brainrot",
  "display.placeholder": "Afbeelding verschijnt hier",
  "display.download": "Download Afbeelding",
  "display.download.aria": "Download afbeelding",
  "footer.poweredBy": "Aangedreven door Gemini",
  "inspiration.title": "Inspiratie: Wat is Brainrot?",
  "error.uploadFirst": "Upload alstublieft eerst een afbeelding.",
  "error.unknown": "Er is een onbekende fout opgetreden.",
  "error.noImageGenerated": "Geen afbeelding gegenereerd door de API.",
  "error.generationFailed": "Kon de afbeelding niet genereren. Controleer de console voor meer details.",
  "gemini.prompt.base": "BELANGRIJKE OPDRACHT: Transformeer de persoon op deze foto tot een absurde, 'brainrot' hybride door deze letterlijk te laten versmelten met {OBJECT}.\n\nSTAP 1: ISOLEER & VERWIJDER. Isoleer de persoon volledig van de originele achtergrond. De originele achtergrond moet compleet verdwijnen.\n\nSTAP 2: FUSEER & MUTEER HET GEZICHT. Creëer een FOTOREALISTISCHE en naadloze samensmelting. DIT IS DE BELANGRIJKSTE REGEL: Het moet een diepe, 3D-integratie zijn. Het gezichtsoppervlak moet volledig transformeren. Het moet lijken alsof het gezicht fysiek gebeeldhouwd is uit het materiaal van het nieuwe object/dier. De textuur en het materiaal moeten de contouren van het gezicht volgen. VOORBEELD: Als het object een ananas is, moet de huid van het gezicht de textuur en het patroon van een ananasschil krijgen. De belichting en schaduwen op het gezicht moeten perfect overeenkomen met de rest van het karakter en de omgeving, waardoor het één geheel wordt. De overgang tussen het 'herkenbare' gezicht en de rest van het gemuteerde hoofd/lichaam moet vloeiend en onzichtbaar zijn. De rest van het lichaam en hoofd versmelt volledig.\n\nSTAP 3: CREËER OMGEVING. Plaats het nieuwe, gemuteerde karakter in een compleet nieuwe, thematisch passende en surrealistische omgeving. De omgeving moet de absurde transformatie aanvullen en versterken.\n\nSTAP 4: GEEF HET LEVEN. Zorg ervoor dat het karakter niet statisch is. Geef het een dynamische pose of een gezichtsuitdrukking die suggereert dat het kan bewegen, reageren en leven in zijn nieuwe omgeving. Het moet aanvoelen als een echt, levend wezen, niet als een standbeeld.\n\nFINALE EISEN: Het eindresultaat moet één samenhangend, fotorealistisch beeld zijn. De persoon moet zichzelf duidelijk kunnen herkennen, ondanks de absurde mutatie. Geen losse emoji's.",
  "gemini.prompt.defaultObject": "een willekeurig dier of voorwerp"
}
